
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// BSLLS:UnusedLocalVariable-off
&НаСервере
Перем _ОбработкаОбъект; // объект текущей обработки

&НаКлиенте
Перем _СтдКлиент; // модуль СтдСтр на клиенте

&НаКлиенте
Перем _МенеджерУведомленийДоступен;
// BSLLS:UnusedLocalVariable-on

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// см. ДлительныеОперации.ПроверитьСостояние() 
//
&НаКлиенте
Процедура ПроверитьСостояние(ОписаниеЗадания, ОжидатьЗавершение = Ложь, ВремяОжидания = 0) Экспорт

	Если ТипЗнч(ОписаниеЗадания) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Ожидается структура описания операции'");
	КонецЕсли;
	
	ПроверитьСостояниеНаСервере(ОписаниеЗадания, ОжидатьЗавершение, ВремяОжидания);

КонецПроцедуры

// см. ДлительныеОперации.ПодключитьОбработчикУведомлений()
//
&НаКлиенте
Процедура ПодключитьОбработчикУведомлений(Ключ, ОповещениеОЗавершении) Экспорт
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		ВызватьИсключение НСтр("ru='Не указан ключ уведомления'");
	КонецЕсли;
	
	МенеджерУведомленийКлиента = МенеджерУведомленийКлиентаЛок();
	МенеджерУведомленийКлиента.ПодключитьОбработчик(Ключ, ОповещениеОЗавершении);
	
КонецПроцедуры

// Конструктор клиентских параметров выполнения ФЗ
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - уникальный идентификатор формы (или связанного с ней контекста)
//  КлючФоновогоЗадания	   - Строка - ключ фонового задания для контроля уникальности
// 
// Возвращаемое значение:
//  Структура - см. ПараметрыВыполнения()
//    * КлючФоновогоЗадания       - Строка - ключ фонового задания для уникальности. Необязательный параметр.
//                                         Если не будет задан, то сформируется автоматически
//    * АдресРезультата           - Строка - адрес временного хранилища для получения результата на клиенте.
//                                    Формируется автоматически по переданному уникальному идентификатору
//    * КлючОбработчикаУведомлений - Строка - ключ уведомлений, для которых будет вызван обработчик завершения 
//                                              фонового задания. Не требует заполнения, но может быть изменен.
//
&НаКлиенте
Функция НовыеПараметрыВыполнения(Идентификатор, КлючФоновогоЗадания = Неопределено) Экспорт
	
	Если ТипЗнч(Идентификатор) <> Тип("УникальныйИдентификатор") Тогда
		ВызватьИсключение НСтр("ru='Не указан уникальный идентификатор для длительной операции'");
	КонецЕсли;
	
	Результат = ПараметрыВыполнения();
	
	Результат.КлючФоновогоЗадания = КлючФоновогоЗадания;
	Результат.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Идентификатор);
	Результат.КлючОбработчикаУведомлений = НовыйКлючОбработчикаУведомлений();
	
	Возврат Результат;

КонецФункции

// Прерывает выполнение фонового задания (см. ДлительныеОперации.ОтменитьВыполнение)
//
// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор - идентификатор
//
&НаКлиенте
Процедура ОтменитьВыполнение(ИдентификаторЗадания) Экспорт

	Если ИдентификаторЗадания = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор фонового задания для прерывания'");
	КонецЕсли;

	ОтменитьВыполнениеНаСервере(ИдентификаторЗадания);
	
КонецПроцедуры

// Отключает обработчик уведомлений (см. в документации)
//
// Параметры:
//  Ключ - Строка - ключ уведомлений
//
&НаКлиенте
Процедура ОтключитьОбработчикУведомлений(Ключ) Экспорт
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		ВызватьИсключение НСтр("ru='Не указан ключ уведомления для отключения'");
	КонецЕсли;
	
	МенеджерУведомленийКлиента = МенеджерУведомленийКлиентаЛок();
	МенеджерУведомленийКлиента.ОтключитьОбработчик(Ключ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// МОДЕЛИ

&НаКлиенте
Функция ПараметрыВыполнения()
	
	Результат = Новый Структура;
	Результат.Вставить("АдресРезультата", Неопределено);
	Результат.Вставить("КлючФоновогоЗадания", Неопределено);
	Результат.Вставить("КлючОбработчикаУведомлений", "");
	
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция МенеджерУведомленийКлиентаЛок()

	Результат = Вычислить("УведомленияКлиента");
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДоступенМенеджерУведомленийКлиента()
	
	Если _МенеджерУведомленийДоступен = Неопределено Тогда
		Результат = Модуль_СтдКлиент().Стр().ВерсияПлатформыБольшеИлиРавна("8.3.26");
	Иначе
		Результат = _МенеджерУведомленийДоступен;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НовыйКлючОбработчикаУведомлений()
	
	Результат = "";
	Если ДоступенМенеджерУведомленийКлиента() Тогда
		Результат = "МодульДлительныхОпераций.ОбработчикСерверныхУведомленийСлужебный";
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ПроверитьСостояниеНаСервере(ОписаниеЗадания, ОжидатьРезультат, ВремяОжидания)
	
	МенеджерБиблиотеки = ОбработкаОбъект();
	МенеджерБиблиотеки.ПроверитьСостояние(ОписаниеЗадания, ОжидатьРезультат, ВремяОжидания);

КонецПроцедуры

&НаСервере
Процедура ОтменитьВыполнениеНаСервере(ИдентификаторЗадания)
	
	МенеджерБиблиотеки = ОбработкаОбъект();
	МенеджерБиблиотеки.ОтменитьВыполнение(ИдентификаторЗадания);
	
КонецПроцедуры

&НаКлиенте
Функция Модуль_СтдКлиент()
	
	Если _СтдКлиент = Неопределено Тогда
		
		ИмяФормыСтд = "Обработка.КонтурДиадокСтд.Форма.Клиент";
		Если ЭтоВнешняяОбработка Тогда
			ИмяФормыСтд = "Внешняя" + ИмяФормыСтд;
		КонецЕсли;
		
		// BSLLS:GetFormMethod-off
		_СтдКлиент = ПолучитьФорму(ИмяФормыСтд, , ЭтаФорма);
		// BSLLS:GetFormMethod-on
	КонецЕсли;
	
	Возврат _СтдКлиент;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЕРВИСНЫЕ МЕТОДЫ

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Модуль = ОбработкаОбъект();
	
	ПроверяемыеСвойства = Новый Структура;
	ПроверяемыеСвойства.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПроверяемыеСвойства, Модуль);
	
	ЭтоВнешняяОбработка = (ПроверяемыеСвойства.ИспользуемоеИмяФайла <> Неопределено);
	
КонецПроцедуры
